Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
		uint32_t ClockHz = CLOCK_GetRootClockFreq (FlexSPIClock);
	#else
		#error "unknon controller family"
	#endif
	DeviceConfig.flexspiRootClk = ClockHz;

	// Get FLEXSPI default settings and configure the FlexSPI.
	flexspi_config_t config {};
	FLEXSPI_GetDefaultConfig (&config);

	// Need to set the combination-enable option. This options combines 8 data lines from FlexSPI channel A with
	// 4 data lines from FlexSPI channel B to form an 8-line bus for octal. On this SoC this is the only way to enable octal.
	#if !(defined(FSL_FEATURE_FLEXSPI_HAS_NO_MCR0_COMBINATIONEN) && FSL_FEATURE_FLEXSPI_HAS_NO_MCR0_COMBINATIONEN)
		config.enableCombination          = (MemType == MemType_OctaSPI_DDR || MemType == MemType_OctaSPI);	// Only true when using Octa-Mode
	#endif
	config.ahbConfig.enableAHBPrefetch    = true;	// Enable AHB prefetching
	config.ahbConfig.enableAHBBufferable  = true;
	config.ahbConfig.enableReadAddressOpt = true;
	config.ahbConfig.enableAHBCachable    = true;
	config.rxSampleClock                  = kFLEXSPI_ReadSampleClkLoopbackInternally;

	FLEXSPI_Init           (base, &config);
	FLEXSPI_SetFlashConfig (base, &DeviceConfig, FlexSPI_Helper::port);   // Configure flash settings according to serial flash feature.
	FLEXSPI_UpdateLUT      (base, 0, &Generic::LUT_SPI.front(), Generic::LUT_SPI.size()); // Update LUT table
	FLEXSPI_SoftwareReset  (base);                                        // Do software reset.


	// Get the JEDEC Informations
	DeviceInfo Info {};
	status_t status = ReadJEDEC (base, &Info);
	if (status != kStatus_Success || Info.ManufactureID == ManufactureID_UNDEF)
	{
		status = Macronix::TryDetect (*base, Info);
		if (status != kStatus_Success || Info.ManufactureID == ManufactureID_UNDEF)
		{
			DebugPrint ("JEDEC read Error\r\n");
			return LibmemStaus_InvalidDevice;
		}
	}

	// Check for the Manufacture-ID and adapt the Configuration
	const FlexSPI_LUT *lut = nullptr;
	LibmemStatus_t res = LibmemStaus_Success;
	if (Info.ManufactureID == ManufactureID_AdestoTechnologies)
	{
		res = Adesto::Initialize (*base, MemType, Info, config, DeviceConfig);
	}
	else if (Info.ManufactureID == ManufactureID_Atmel)
	{
		DebugPrint ("Found Atmel Flash\r\n");
		if (Info.Type == 0xA8)
		{
			res = Adesto::Initialize (*base, MemType, Info, config, DeviceConfig);
		}
		else
		{
			status_t stat = base->SendCommand (0, LUT_EnterQPI_Atmel); // Enter QuadSPI Mode
			if (stat != kStatus_Success)
				return LibmemStaus_Error;
			lut = &Generic::LUT_QuadSPI;
		}
	}
	else if (Info.ManufactureID == ManufactureID_Nexcom)	// Winbond
	{
		DebugPrint ("Found Nexcom Flash\r\n");
		// send write-enable 
		status_t stat = base->WriteEnable (0);
		if (stat != kStatus_Success)
			return LibmemStaus_Error;

		// Write to status/control register 2 to switch to enter quad-Mode
		stat = base->WriteRegister (0, 2, LUT_WriteConfigReg_Winbond);
		if (stat != kStatus_Success)
			return LibmemStaus_Error;

		lut = &Generic::LUT_QuadSPI;
	}
	else if (Info.ManufactureID == ManufactureID_Macronix)
	{
		res = Macronix::Initialize (*base, MemType, Info, config, DeviceConfig);
	}
	else if (Info.ManufactureID == ManufactureID_Lucent)
	{
		DebugPrint ("Found Lucent Flash\r\n");
		status_t stat = base->SendCommand (0, LUT_EnterQPI_ISSI); // Enter QuadSPI Mode
		if (stat != kStatus_Success)
			return LibmemStaus_Error;

		config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
		lut = &ISSI::LUT_QuadSPI;
	}
	else
	{
		DebugPrint ("unknown Flash-memory\r\n");
		return LibmemStaus_InvalidDevice;
	}

	if (res != LibmemStaus_Success)
		return res;

	// Reconfigure the Interface according to the gathered Flash-Information and configuration
	if (MemType == MemType_OctaSPI_DDR || MemType == MemType_QuadSPI_DDR)
	{
		#if (defined MIMXRT633S_SERIES) || defined (MIMXRT685S_cm33_SERIES) || \
			 defined(MIMXRT533S_SERIES) || defined (MIMXRT555S_SERIES) || defined(MIMXRT595S_cm33_SERIES)
			ClockDiv--;
		#elif ((defined MIMXRT1011_SERIES) || (defined MIMXRT1015_SERIES) || (defined MIMXRT1021_SERIES) || (defined MIMXRT1024_SERIES) || \
			   (defined MIMXRT1051_SERIES) || (defined MIMXRT1052_SERIES) || (defined MIMXRT1061_SERIES) || (defined MIMXRT1062_SERIES) || \
			   (defined MIMXRT1064_SERIES))
			ClockDiv = 2;
			CLOCK_SetDiv (FlexSPIDiv, ClockDiv-1);	// flexspi clock divide by two --> 240 Mz.
			DeviceConfig.flexspiRootClk = SourceClock_Hz / ClockDiv;
			DeviceConfig.flexspiRootClk = ClockHz;
		#elif (defined MIMXRT1165_cm7_SERIES) || (defined MIMXRT1166_cm7_SERIES) || (defined MIMXRT1165_cm4_SERIES) || (defined MIMXRT1166_cm4_SERIES) || \
			  (defined MIMXRT1171_SERIES)     || (defined MIMXRT1172_SERIES)     || \
			  (defined MIMXRT1173_cm7_SERIES) || (defined MIMXRT1175_cm7_SERIES) || (defined MIMXRT1176_cm7_SERIES) || \
			  (defined MIMXRT1173_cm4_SERIES) || (defined MIMXRT1175_cm4_SERIES) || (defined MIMXRT1176_cm4_SERIES)
			CLOCK_ControlGate (FlexSPIClockGate, kCLOCK_Off);	// The module clock must be disabled during clock switch in order to avoid glitch
			CLOCK_SetRootClockMux (FlexSPIClock, 5); // ClockSource_SysPll2 --> 528 MHz
			CLOCK_SetRootClockDiv (FlexSPIClock, 2); // --> 528 MHz / 2 = ~264 MHz
			CLOCK_ControlGate (FlexSPIClockGate, kCLOCK_On);
			DeviceConfig.flexspiRootClk = CLOCK_GetRootClockFreq (FlexSPIClock);
		#else
			#error "unknon controller family"
		#endif
		FLEXSPI_Init (base, &config);
	}

	// Use the size information from the JEDEC-Information to configure the Interface
	uint32_t FlashSize = CalculateCapacity_KBytes (Info.Capacity);
	DeviceConfig.flashSize = FlashSize;
	geometry[0].count = FlashSize / (4096 / 1024);
	FlashSize *= 1024;	// Convert kBytes to bytes

	// changing the clock sourece requires reinit
//	FLEXSPI_Init (base, &config);
	FLEXSPI_SetFlashConfig (base, &DeviceConfig, FlexSPI_Helper::port);	// Configure flash settings according to serial flash feature.

	if (lut != nullptr)
		// Update the LUT
		FLEXSPI_UpdateLUT (base, 0, &lut->front(), lut->size());

	FLEXSPI_SoftwareReset (base);
	status_t stat = base->WaitBusBusy ();
	if (stat != kStatus_Success)
		return LibmemStaus_Error;


	static uint8_t write_buffer[QSPIFLASH_PAGE_SIZE];
	LibmemDriver *FlashHandle = LibmemDriver::GetDriver ();
//	libmem_register_driver (FlashHandle, libmem_GetBaseAddress(base), FlashSize, geometry, nullptr, &DriverFunctions, &DriverFunctions_Extended);
	libmem_register_driver (FlashHandle, libmem_GetBaseAddress(base), FlashSize, geometry, nullptr, &DriverFunctions, nullptr);
	int err = libmem_driver_paged_write_init (&FlashHandle->PageWriteControlBlock, write_buffer, QSPIFLASH_PAGE_SIZE, ProgramPage, 4, 0);
	FlashHandle->user_data = (uint32_t)base;

	uint8_t *AliasAddress = libmem_GetAliasBaseAddress (base);
	if (AliasAddress != nullptr && err == LIBMEM_STATUS_SUCCESS)
	{
		FlashHandle = LibmemDriver::GetDriver ();
		libmem_register_driver (FlashHandle, AliasAddress, FlashSize, geometry, nullptr, &DriverFunctions, nullptr);
		err = libmem_driver_paged_write_init (&FlashHandle->PageWriteControlBlock, write_buffer, QSPIFLASH_PAGE_SIZE, ProgramPage, 4, 0);
		FlashHandle->user_data = (uint32_t)base;
		DebugPrint ("### Add Driver for Alias\r\n");
	}
	return static_cast<LibmemStatus_t>(err);
}


/*! ReadJEDEC
\brief Read the JEDEC Device informations
\param base The Flex-SPI-base to use
\param Info The read Device informations from the flash memory
\return status_t Status of the Operation - kStatus_Success when successfully */
static status_t ReadJEDEC (FlexSPI_Helper *base, struct DeviceInfo *Info)
{
	uint8_t Identification[16] {0U};

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = 0;
	flashXfer.port          = FlexSPI_Helper::port;
	flashXfer.cmdType       = kFLEXSPI_Read;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ReadJEDEC_ID;
	flashXfer.data          = (uint32_t *)Identification;
	flashXfer.dataSize      = sizeof(Identification);

